/************************************版权申明********************************************
**                             广州大彩光电科技有限公司
**                             http://www.gz-dc.com
**-----------------------------------文件信息--------------------------------------------
** 文件名称:   ulitity.c
** 修改时间:   2018-05-18
** 文件说明:   用户MCU串口驱动函数库
** 技术支持：  Tel: 020-82186683  Email: hmi@gz-dc.com Web:www.gz-dc.com
--------------------------------------------------------------------------------------*/
#include "ulitity.h"
#include "cmd_queue.h"



/*! 
*  \brief    串口接收中断程序
*/
void serial() interrupt 4
{
    if(RI)                                            //接收到窗口数据
    {
        RI= 0;
        queue_push(SBUF);                             //压入到指令缓冲区
    }
}

