/*
01功能近似03
02功能近似04
05功能近似06
15功能近似16 区别在于离散与整型 02 04用于限制只读 离散与整型区分为了限制位错误操作
*/


/*************************离散寄存器（可读可写）可控制功能码 01 05 15****************************************/
#define RWSTATUES0                 		 0    
#define RWSTATUES1                		 1    
/*************************离散寄存器（只读）可控制功能码 02****************************************/
#define ROSTATUES0                      10000   
#define ROSTATUES1                      10001    
/********************输入寄存器（只能读）可控制功能码 04***********************************/
#define RODAT0                         30000     
#define RODAT1                         30001    
#define RODAT2                         30002  
#define TEMP                           30003   	  //浮点型占两个字节 
#define RODAT3                         30005         //
/*****************保持寄存器(可读可写)可控制功能码 03 06 16******************************/
#define RWDAT0                          40000        
#define RWDAT1                          40001       
#define RWDAT2                          40002 
#define ADC                             40003   //long型占两个字节     
#define RWDAT3                          40005    



  











    














