/****************************************Copyright (c)**************************************************
**                               广州周立功单片机发展有限公司
**                                     研    究    所
**                                        产品一部 
**
**                                 http://www.zlgmcu.com
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名: uart0.h
**创   建   人: 陈明计
**最后修改日期: 2004年2月19日
**描        述: μCOS-II下LPC210x的UART0底层驱动头文件
**              
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人: 
** 版  本: 
** 日　期: 
** 描　述: 
**
**--------------当前版本修订------------------------------------------------------------------------------
** 修改人: 
** 日　期: 
** 描　述: 
**
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/

#define NOT_INIT_MODEM      0x00
#define NOT_FIND_MODEM      0x01
#define MODEM_CLOSE         0x02
#define MODEM_RING          0x03
#define MODEM_CONNECT       0x05


#ifndef IN_MODEM

extern uint8 GetModemState(void);
extern uint8 ModemWrite(char *Data, uint16 NByte);
extern uint8 ModemGetch(void);
extern uint8 ModemDialUp(char Number[]);
extern uint8 ModemDialDown(void);
extern uint8 ModemInit(uint32 bps);
extern void UART1_Exception(void);

#endif

/*********************************************************************************************************
**                            End Of File
********************************************************************************************************/
